tags/v1.0.6_071120/code/docs/en/dguide/examples/stock-quote.xml

<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <SOAP-ENV:Body>
    <NS0:GetQuote xmlns:NS0="http://ws.cdyne.com/">
      <NS0:StockSymbol>ORCL</NS0:StockSymbol>
      <NS0:LicenseKey>0</NS0:LicenseKey>
    </NS0:GetQuote>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
