soap-testdata.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetQuote xmlns="http://ws.cdyne.com/">
      <StockSymbol>NSE:WIPRO Ltd</StockSymbol>
      <LicenseKey>0</LicenseKey>
    </GetQuote>
  </soap:Body>
</soap:Envelope> 