Request/sent/2_tempService2_2018-04-04_11-36-14.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Body>
    <GetQuote xmlns="http://ws.cdyne.com/">
      <StockSymbol>V3</StockSymbol>
      <LicenseKey>0</LicenseKey>
    </GetQuote>
  </soap:Body>
</soap:Envelope>